## **[MySQL DISTINCT](https://www.mysqltutorial.org/mysql-distinct.aspx)**

Use the MySQL DISTINCT clause in the SELECT statement to eliminate duplicate rows in a result set.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL DISTINCT clause

syntax:

SELECT DISTINCT
    select_list
FROM
    table_name
WHERE 
    search_condition
ORDER BY 
    sort_expression;

In [3]:
SVG('../images/MySQL-Distinct.svg')

### MySQL DISTINCT clause examples

In [4]:
string = '''
SELECT lastName 
FROM employees 
ORDER BY lastName
;'''
pd.read_sql(string, engine)

     lastName
0      Bondur
1      Bondur
2        Bott
3         Bow
4    Castillo
..        ...
18  Patterson
19  Patterson
20   Thompson
21      Tseng
22     Vanauf

[23 rows x 1 columns]

In [5]:
string = '''
SELECT DISTINCT lastName
FROM employees
ORDER BY lastName
;'''
df1 = pd.read_sql(string, engine)

In [6]:
df2 = (
    pd.read_sql_table('employees', engine)
    .drop_duplicates(subset='lastName')
    .sort_values(
        by='lastName', ignore_index=True)
    [['lastName']]
)

In [7]:
df1.equals(df2)

True

In [8]:
df1.head()

   lastName
0    Bondur
1      Bott
2       Bow
3  Castillo
4  Firrelli

### MySQL DISTINCT and NULL values

In [9]:
string = '''
SELECT DISTINCT state
FROM customers;
'''

df1 = pd.read_sql(string, engine)

In [10]:
df2 = (
    pd.read_sql_table('customers', engine)
    .drop_duplicates(subset='state', ignore_index=True)
    [['state']]
)

In [11]:
df1.equals(df2)

True

In [12]:
df1.head()

      state
0      None
1        NV
2  Victoria
3        CA
4        NY

### MySQL DISTINCT with multiple columns

In [13]:
string = '''
SELECT DISTINCT
    state, city
FROM
    customers
WHERE
    state IS NOT NULL
ORDER BY
    state, city;
'''
df1 = pd.read_sql(string, engine)

In [14]:
df2 = (
    pd.read_sql_table('customers', engine)
    [['state', 'city']]
    .dropna(subset='state')
    .drop_duplicates()
    .sort_values(
        by=['state', 'city'],
        ignore_index=True,
        key=lambda col: col.str.upper())
)

In [15]:
df1.equals(df2)

False

In [16]:
(df1 != df2).sum()

state    2
city     2
dtype: int64

In [17]:
df1.loc[df1.state != df2.state, :]

         state            city
32      Québec        Montréal
33  Queensland  South Brisbane

In [18]:
df2.loc[df1.state != df2.state, :]

         state            city
32  Queensland  South Brisbane
33      Québec        Montréal

In [19]:
df1.head()

  state        city
0    BC   Tsawassen
1    BC   Vancouver
2    CA    Brisbane
3    CA     Burbank
4    CA  Burlingame